OpenFOAM-13/tutorials/incompressibleVoF/planingHullW3/Allmesh.2
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceTransformPoints \
    "translate=(-0.586 0 -0.156), \
    Ry=-3.485, \
    translate=(0.586 0 0.156)" \
    constant/geometry/w3_orig.stl constant/geometry/w3.stl

runApplication surfaceFeatures

runApplication blockMesh -dict system/blockMeshDict.2

runApplication refineMesh -dict system/refineMeshDict.2

runApplication snappyHexMesh -dict system/snappyHexMeshDict.2

runApplication renumberMesh -noFields

#------------------------------------------------------------------------------
